/* 
 * File:   constdef.h
 * Author: Serg Alexeev sealeks@mail.ru
 *
 * Created on     тест  30 ноября 2009 года., 22:11
 */

#ifndef _DVNCI_KRNL_CONSTDEF_H
#define	_DVNCI_KRNL_CONSTDEF_H


#if defined(__MINGW32__) && defined(_amd64_)
        #define _DVN_WIN64_MGW_
#elif defined(__MINGW32__)
        #define _DVN_WIN32_MGW_
#elif defined(_MSC_VER) && defined(_WIN64)
        #define _DVN_WIN64_VC_ 
#elif defined(_MSC_VER) 
        #define _DVN_WIN32_VC_ 
#elif defined(__GNUC__) && defined(__amd64__)
        #define _DVN_LIN64_GNU_ 
#elif defined(__GNUC__)
        #define _DVN_LIN32_GNU_ 
#else
        #error PlatformXCompiler spec dont defined
#endif

#if defined(_DVN_WIN32_MGW_) || defined(_DVN_WIN32_VC_)
        #define _DVN_WIN32_
#elif defined(_DVN_WIN64_MGW_) || defined(_DVN_WIN64_VC_)
        #define _DVN_WIN64_
#elif defined(_DVN_LIN32_GNU_)
        #define _DVN_LIN32_
#elif defined(_DVN_LIN64_GNU_)
        #define _DVN_LIN64_
#else
        #error Platform spec dont defined
#endif

#if defined(_DVN_WIN32_) || defined(_DVN_WIN64_)
        #define _DVN_WIN_
#elif defined(_DVN_LIN32_GNU_) || defined(_DVN_LIN64_GNU_)
        #define _DVN_LIN_
#else
        #error Platform spec dont defined
#endif




#ifdef _MSC_VER
#ifndef WIN32_LEAN_AND_MEAN
#define WIN32_LEAN_AND_MEAN
#endif
#pragma warning(disable: 4101  4146 )
#endif


// set python styling
// set formating Netbeans
// except Otherparenthesis = true;  Другая круглая скобка

#define DEBUG_STR_VAL_DVNCI(a,b)  std::cout << #a  << " " << #b" = "  << b  << std::endl;
#define DEBUG_VAL_DVNCI(a)  std::cout << #a" = "  << a  << std::endl;
#define DEBUG_VAL2_DVNCI(a,b)  std::cout << #a" = "  << a  << " " << #b" = "  << b  << std::endl;
#define DEBUG_VAL3_DVNCI(a,b,c)  std::cout << #a" = "  << a  << " " << #b" = "  << b  << " " << #c" = "  << c  << std::endl;



#elif DVNCI_DEDUGFILE

#define LOCKGLOBALOUT_DVNCI boost::mutex::scoped_lock lock(global_out_mutex());
#define DEBUG_STR_DVNCI(a)  std::cout << #a  << std::endl;
#define DEBUG_STR_VAL_DVNCI(a,b)  std::cout << #a  << " " << #b" = "  << b  << std::endl;
#define DEBUG_VAL_DVNCI(a)  std::cout << #a" = "  << a  << std::endl;
#define DEBUG_VAL2_DVNCI(a,b)  std::cout << #a" = "  << a  << " " << #b" = "  << b  << std::endl;
#define DEBUG_VAL3_DVNCI(a,b,c)  std::cout << #a" = "  << a  << " " << #b" = "  << b  << " " << #c" = "  << c  << std::endl;


#else

#define LOCKGLOBALOUT_DVNCI  ;
#define DEBUG_STR_DVNCI(a)  ;
#define DEBUG_STR_VAL_DVNCI(a,b) ;
#define DEBUG_VAL_DVNCI(a)  ;
#define DEBUG_VAL2_DVNCI(a,b)  ;
#define DEBUG_VAL3_DVNCI(a,b,c)  ;


#endif

#define DEBUG_BASE_DVNCI(a,b)  a->log(#b);
#define DEBUGW_BASE_DVNCI(a,b)  a->logwarning(#b);
#define DEBUGE_BASE_DVNCI(a,b)  a->logerror(#b);

#ifdef _MSC_VER
#pragma warning(disable: 4200 4800)
#endif

#ifdef  _DVN_WIN_
#define BOOST_INTERPROCESS_WINDOWS
#endif

#ifdef  _DVN_WIN_
  const std::string SYSTEM_SHARE_SPEC = "Global\\";
#else
  const std::string SYSTEM_SHARE_SPEC = "";
#endif

namespace dvnci {


#if defined(_DVN_WIN32_MGW_)
    typedef unsigned char      unum8;
    typedef char               num8;
    typedef unsigned short     unum16;
    typedef short              num16;
    typedef unsigned int       unum32;
    typedef int                num32;
    typedef unsigned long long unum64;
    typedef long long          num64;
    typedef unum32             ounum;
    typedef num32              onum;
    typedef std::size_t        indx;
#elif defined(_DVN_WIN32_VC_)
    typedef unsigned char      unum8;
    typedef char               num8;
    typedef unsigned short     unum16;
    typedef short              num16;
    typedef unsigned int       unum32;
    typedef int                num32;
    typedef unsigned long long unum64;
    typedef long long          num64;
    typedef unum32             ounum;
    typedef num32              onum;
    typedef std::size_t        indx;
#elif defined(_DVN_LIN64_GNU_)
    typedef unsigned char      unum8;
    typedef char               num8;
    typedef unsigned short     unum16;
    typedef short              num16;
    typedef unsigned int       unum32;
    typedef int                num32;
    typedef unsigned long long unum64;
    typedef long long          num64;

    typedef unum64             ounum;
    typedef num64              onum;
   
    typedef std::size_t        indx;    
#else    
    #error Type not defined. Spec compiler and OS error
#endif

    
    typedef boost::posix_time::ptime datetime;

    typedef union type_punned{
        
         type_punned(const bool& vl) : n64(vl ? 1 : 0) {}
         type_punned(const unum8& vl) : u8(vl) {}
         type_punned(const num8& vl) : n8(vl) {}
         type_punned(const unum16& vl) : u16(vl) {}
         type_punned(const num16& vl) : n16(vl) {}
         type_punned(const unum32& vl) : u32(vl) {}
         type_punned(const num32& vl) : n32(vl) {}
         type_punned(const unum64& vl) : u64(vl) {}
         type_punned(const num64& vl) : n64(vl) {}
         type_punned(const float& vl) : fl(vl) {}
         type_punned(const double& vl) : dbl(vl) {}
         bool     bl;
         unum8    u8;
         num8     n8;
         unum16   u16;
         num16    n16;
         unum32   u32;
         num32    n32;
         unum64   u64;
         num64    n64;
         float    fl;
         double   dbl;} * ptype_punned;

    const indx npos              = static_cast<indx>(-1);

    const  num64 DVNCI_VERSION   = 0x4;

    const  size_t  MAX_NUM32_SIGNED = 0x1000; //FFFFFFF;

    const size_t  DVNCI_MAXVALUESTRSIZE   = 0xFC;

    const unsigned int DEFAULT_DVNCI_TIMOUT = 5000; //FFFFFFF

    const size_t  USERNAME_STRINGSIZE     = 100;
    const size_t  LOGMESSAGE_STRINGSIZE   = 400;
    const size_t  HOST_STRINGSIZE         = 200;

    const size_t  GROP_CONFIG_SIZE         = 144;

    const  double NULL_DOUBLE = std::numeric_limits<double>::quiet_NaN();
    const  double DV_PI_CONST = 3.14159265358979324;
    const  double DV_E_CONST =  2.71828182845904523;

    static inline bool isNaN(const double& vl) {
        return (vl != vl);}

    const   indx nill_ptr = 0;
    const   indx able_ptr = 1;

    
    BOOST_STATIC_ASSERT(sizeof(num8) == 1);
    BOOST_STATIC_ASSERT(sizeof(unum8) == 1);
    BOOST_STATIC_ASSERT(sizeof(num16) == 2);
    BOOST_STATIC_ASSERT(sizeof(unum16) == 2);
    BOOST_STATIC_ASSERT(sizeof(num32) == 4);
    BOOST_STATIC_ASSERT(sizeof(unum32) == 4);
    BOOST_STATIC_ASSERT(sizeof(num64) == 8);
    BOOST_STATIC_ASSERT(sizeof(unum64) == 8);
    BOOST_STATIC_ASSERT(sizeof(double) == 8);
    BOOST_STATIC_ASSERT(sizeof(float) == 4);    
    BOOST_STATIC_ASSERT(sizeof(datetime) == 8);  
    
    

    const   boost::posix_time::ptime nill_time = boost::posix_time::ptime();
    const   boost::posix_time::ptime epoch_time = boost::posix_time::ptime(boost::gregorian::date(1970,1,1));


    // tag type
    typedef onum   tagtype;
    // node type
    typedef tagtype nodetype;
    // application id type
    typedef tagtype appidtype;
    // service id type
    typedef tagtype servidtype;
    // report type
    typedef tagtype reporttype;
    //chanal type for group // RS232, TCP/ID, TCP/IPv6.....
    typedef onum chnltype;
    // operator access level type
    typedef onum acclevtype;
    //locale type
    typedef onum lcltype;
    // debug level type
    typedef onum debuglvtype;
    // valid level type
    typedef onum vlvtype;
    // system queue message type
    typedef num32 qumsgtype;
    // report statisic type
    typedef onum repstattype;
    // database provider type
    typedef onum dbprovtype;
    // event queue type set
